/*     Задача 5. Вивести на екран 10 рядків по 15 букв «о» у кожному. Після кожного рядка вивести рядок із 15 символів «-».

1.ооооооооооооооо
---------------
2.ооооооооооооооо
---------------
3.ооооооооооооооо
---------------
. . . . . . . . 
10.ооооооооооооооо
---------------    */

document.write(`<pre>`);

for (let i = 0; i <= 9; i++) {
  document.write(i + 1, `.`);
  for (let j = 0; j < 15; j++) {
    document.write("0");
  }
  document.write("<br>");
  for (let k = 0; k < 15; k++) {
    document.write("-");
  }
  document.write("<br>");
}
document.write(`</pre>`);
